IDEA Open Model
CrossSectionConversionTable Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Conversion table of cross-section
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum CrossSectionConversionTable
Public Enumeration CrossSectionConversionTable
Members
Member name | Value | Description
NoUsed | 0 |  Conversion table will be not used
SCIA | 1 |  Conversion table of SCIA CSS will be used
Autodesk | 2 |  Conversion table of Autodesk CSS will be used, it is useable for Robot, Revit, ...
SAP2000 | 3 |  Conversion table of SAP2000 will be used, it is useable for SAP2000 ...
StaadPro | 4 |  Conversion table of StaadPro CSS will be used, it is useable for StaadPro, ...
AdvanceDesign | 5 |  Conversion table of AdvanceDesign CSS will be used, it is useable for AdvanceDesign, ...
See Also
Reference
IdeaRS.OpenModel Namespace